{
    "architectures": [
        "DiaForConditionalGeneration"
    ],
    "bos_token_id": 1026,
    "decoder_config": {
        "cross_head_dim": 64,
        "cross_hidden_size": 512,
        "cross_num_attention_heads": 8,
        "cross_num_key_value_heads": 8,
        "head_dim": 64,
        "hidden_act": "silu",
        "hidden_size": 512,
        "initializer_range": 0.02,
        "intermediate_size": 2048,
        "max_position_embeddings": 1024,
        "model_type": "dia_decoder",
        "norm_eps": 0.00001,
        "num_attention_heads": 8,
        "num_channels": 9,
        "num_hidden_layers": 6,
        "num_key_value_heads": 2,
        "rope_scaling": null,
        "rope_theta": 10000.0,
        "vocab_size": 1028
    },
    "delay_pattern": [
        0,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15
    ],
    "encoder_config": {
        "head_dim": 64,
        "hidden_act": "silu",
        "hidden_size": 512,
        "initializer_range": 0.02,
        "intermediate_size": 2048,
        "max_position_embeddings": 512,
        "model_type": "dia_encoder",
        "norm_eps": 0.00001,
        "num_attention_heads": 8,
        "num_hidden_layers": 4,
        "num_key_value_heads": 8,
        "rope_scaling": null,
        "rope_theta": 10000.0,
        "vocab_size": 256
    },
    "eos_token_id": 1024,
    "initializer_range": 0.02,
    "is_encoder_decoder": true,
    "model_type": "dia",
    "norm_eps": 0.00001,
    "pad_token_id": 1025,
    "torch_dtype": "float32",
    "transformers_version": "4.53.0.dev0"
}